# CLI Tools (Core)
brew "micro"
brew "git"
brew "tree"
brew "curl"
brew "cmake"
brew "llvm"
brew "btop"
brew "htop"
brew "zsh"
brew "starship"
brew "mise"
brew "translate-shell"
brew "cocoapods"
brew "tmux"
brew "sl"
brew "fzf"
brew "git-delta"
