# CLI Tools
brew "micro"
brew "git"
brew "tree"
brew "curl"
brew "cmake"
brew "llvm"
brew "btop"
brew "htop"
brew "translate-shell"
brew "colima"
brew "docker"
brew "docker-compose"

# GUI Apps
cask "visual-studio-code"
cask "thebrowsercompany-dia"
cask "vivaldi"
