# Visual Studio Code Extensions
# format: EXTENSION_ID
bierner.markdown-mermaid
charliermarsh.ruff
davidanson.vscode-markdownlint
donjayamanne.githistory
formulahendry.code-runner
github.copilot-chat
github.vscode-github-actions
google.colab
google.gemini-cli-vscode-ide-companion
inferrinizzard.prettier-sql-vscode
james-yu.latex-workshop
marp-team.marp-vscode
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.powershell
myriad-dreamin.tinymist
oderwat.indent-rainbow
reditorsupport.r-syntax
tyriar.luna-paint
yzhang.markdown-all-in-one